2022-05-21-214020-introduction_to_tla.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2023-07-12 Wed 21:08 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Introduction to TLA+</title>
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="/static/org.css" />
</head>
<body>
<div id="preamble" class="status">
<nav class="navbar">
  <div class="navbar-mode-line">
    <a href="/" class="navbar-circle">◉</a>
    <a href="/programming" class="navbar-filename">programming</a>
    <a href="/hacking" class="navbar-filename">hacking</a>
    <a href="/Tutorial" class="navbar-filename">Tutorials</a>
    <a href="/posts.html" class="navbar-filename">All Posts</a>
  </div>
</nav>
</div>
<div id="content" class="content">
<h1 class="title">Introduction to TLA+</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#ID-995c4ebf-1328-449f-a566-c37094d82c8e">What is TLA+</a>
<ul>
<li><a href="#ID-0f9e8a40-e26c-4fdb-93ba-11faa6d812f1">What is a digital system?</a></li>
<li><a href="#ID-6fcc4a3f-53fc-4e5c-adff-834afc219b89">What does "high level" mean</a></li>
<li><a href="#ID-769ecbfe-4984-448f-bf8c-7b4d37adc1a4">What can you check with TLA+</a></li>
<li><a href="#ID-c3009a20-3b5f-4e29-b550-3578bb4e4b25">Why model a concurent system as a sequence of steps?</a></li>
<li><a href="#ID-42e23a1e-fa0e-424a-9353-55b7ec93edaa">State Machine</a>
<ul>
<li><a href="#ID-dc37fe7c-0fa8-40d7-b87d-105f4de7a1e5">What is a state machine?</a></li>
</ul>
</li>
</ul>
</li>
</ul>
</div>
</div>
<div id="outline-container-ID-995c4ebf-1328-449f-a566-c37094d82c8e" class="outline-2">
<h2 id="ID-995c4ebf-1328-449f-a566-c37094d82c8e">What is TLA+</h2>
<div class="outline-text-2" id="text-orgb263561">
<p>
It is a lanaguage for high-level modeling of digital systems.
It can check these models.
</p>

<p>
It is used to model critical parts of digital systems while abstracting away from the code that implements the system.
It was designed to model concurent and distrubted systems.
</p>

<p>
you can find design errors and correct them before writing any code.
</p>
</div>

<div id="outline-container-ID-0f9e8a40-e26c-4fdb-93ba-11faa6d812f1" class="outline-3">
<h3 id="ID-0f9e8a40-e26c-4fdb-93ba-11faa6d812f1">What is a digital system?</h3>
<div class="outline-text-3" id="text-org7980fa1">
<p>
A digital system includes:
</p>

<ul class="org-ul">
<li>Algorithms</li>
<li>Programs</li>
<li>Computer systsems</li>
</ul>

<p>
You can abstract its continuouse evolution as a sequence of discrete events
</p>
</div>
</div>
<div id="outline-container-ID-6fcc4a3f-53fc-4e5c-adff-834afc219b89" class="outline-3">
<h3 id="ID-6fcc4a3f-53fc-4e5c-adff-834afc219b89">What does "high level" mean</h3>
<div class="outline-text-3" id="text-org1a74091">
<p>
high level means above the code level/implentation level
</p>
</div>
</div>


<div id="outline-container-ID-769ecbfe-4984-448f-bf8c-7b4d37adc1a4" class="outline-3">
<h3 id="ID-769ecbfe-4984-448f-bf8c-7b4d37adc1a4">What can you check with TLA+</h3>
<div class="outline-text-3" id="text-org9bad263">
<p>
you use TLA+ to ensure the system you build "works right".
working right means that you sastify certain properties.
</p>

<p>
The properties TLA+ can check are conditions on individual executions, not a percentage of executions.
</p>

<p>
the system satified property if every single execution does.
</p>
</div>
</div>


<div id="outline-container-ID-c3009a20-3b5f-4e29-b550-3578bb4e4b25" class="outline-3">
<h3 id="ID-c3009a20-3b5f-4e29-b550-3578bb4e4b25">Why model a concurent system as a sequence of steps?</h3>
<div class="outline-text-3" id="text-org95789c7">
<p>
it might be strange to describe a concurent system as one.
</p>

<p>
you can simulate one with a sequential program, but why not do it? its simple.
</p>
</div>
</div>


<div id="outline-container-ID-42e23a1e-fa0e-424a-9353-55b7ec93edaa" class="outline-3">
<h3 id="ID-42e23a1e-fa0e-424a-9353-55b7ec93edaa">State Machine</h3>
<div class="outline-text-3" id="text-orge4eec8a">
<p>
A execution is a sequence of states.
</p>

<p>
a execution is represented as a behavior
</p>

<p>
A behavior is a sequence of states.
</p>

<p>
We want to speicify all possible behaviors of a system.
</p>
</div>


<div id="outline-container-ID-dc37fe7c-0fa8-40d7-b87d-105f4de7a1e5" class="outline-4">
<h4 id="ID-dc37fe7c-0fa8-40d7-b87d-105f4de7a1e5">What is a state machine?</h4>
<div class="outline-text-4" id="text-org2881e5a">
<p>
A state machine is descibed as:
</p>
<ul class="org-ul">
<li>All Possible intial states</li>
<li>What states can follow any given state</li>
</ul>

<p>
if there is no pssible next state, it halts.
</p>

<p>
A state is the signment of values to variables
</p>

<p>
so basicly a state machine is described by:
</p>

<ul class="org-ul">
<li>What the variables are.</li>
<li>Possible initial value of varibles are</li>
<li>A relation between their values and their current state and their values in the next state.</li>
</ul>
</div>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author:  (<a href="mailto:unseen@flake">unseen@flake</a>)</p>
<p class="date">Date: </p>
<p class="creator"><a href="https://www.gnu.org/software/emacs/">Emacs</a> 28.2 (<a href="https://orgmode.org">Org</a> mode 9.5.5)</p>
<p class="validation"></p>
</div>
</body>
</html>
